{
    "jobs": [
      {
        "jobTitle": "Software Engineer III",
        "company": "ENSCO, Inc.",
        "timeFrame": "2019 - Present",
        "skillHighlights": ["Python", "VueJS"],
        "jobDescription": "<ul><li>Developed and expanded automated testing using Selenium and integrated them into Jenkins.</li><li>Wrote Python code to improve software projects and addressed security vulnerabilities.</li><li>Led the integration of software projects, including setup of MATLAB and Python environments.</li><li>Participated in software development projects to meet Air Force customer requirements.</li></ul>"
      },
      {
        "jobTitle": "Software Engineer II",
        "company": "ENSCO, Inc.",
        "timeFrame": "2017- 2019",
        "skillHighlights": ["Java", "Python"],
        "jobDescription": "<ul><li>Key developer for front-end and back-end support in various software projects.</li><li>Developed applications with Oracle SQL, improving data management and user interfaces.</li><li>Initiated builds for Python-based projects, contributing to the company's development process.</li><li>Improved user interfaces for better client feedback and project lead approval.</li></ul>"
      },
      {
        "jobTitle": "Software Testing Internship",
        "company": "ENSCO, Inc.",
        "timeFrame": "2016 – 2017",
        "skillHighlights": ["TestComplete"],
        "jobDescription": "<ul><li>Designed and programmed automated regression tests for applications.</li><li>Updated older tests to work with new software testing tools.</li></ul>"
      },
      {
        "jobTitle": "Software Internship",
        "company": "NetBoss Technology",
        "timeFrame": "2015 – 2015",
        "skillHighlights": ["Elastic Search"],
        "jobDescription": "<ul><li>Integrated new monitoring functionality for customer data analysis.</li><li>Developed a Java server/client application for data management and storage in ElasticSearch.</li><li>Created a JavaScript web interface using Google Maps API to display data from ElasticSearch.</li></ul>"
      },
      {
        "jobTitle": "Software Engineer",
        "company": "8th Domain Technology",
        "timeFrame": "2014 – 2014",
        "skillHighlights": ["Visual Basic"],
        "jobDescription": "<ul><li>Designed a desktop application in VB.NET / Visual C# for chiropractic business management, enabling paperless record keeping.</li></ul>"
      }
    ]
  }
  